Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/hardware_init.c
/* src/hardware_init.c */

/**
 * @file hardware_init.c
 * @brief Application-Specific Hardware Initialization - Motor Control, Sensors, Communication
 *
 * @details
 * # Overview
 *
 * This file implements **Stage 2 of the boot sequence** - application-specific peripheral
 * initialization. It is called **after** system clocks are configured (rx_clock_power_init)
 * but **before** ThreadX RTOS starts (tx_kernel_enter).
 *
 * **Boot sequence context:**
 * ```
 * main() -> rx_clock_power_init() -> hardware_init() -> tx_kernel_enter()
 *           ↑ System clocks        ↑ This file      ↑ Start RTOS
 * ```
 *
 * ## Peripheral Initialization Order (6 Stages)
 *
 * **Critical ordering** - later stages depend on earlier stages:
 *
 * 1. **Precondition validation** (~0.5 µs)
 *    - Verify system clocks initialized (SCKCR3 register check)
 *    - Ensure memory-mapped I/O accessible
 *
 * 2. **GPIO configuration** (planned, not yet implemented)
 *    - Motor control pins (DRV8243 enable, fault detection)
 *    - LED indicators (status, error, activity)
 *    - Sensor chip selects (SPI CS pins)
 *
 * 3. **Timers** (~10 µs) **IMPLEMENTED**
 *    - CMT0 for ThreadX tick (1 kHz)
 *    - MTU for PWM generation (motor control)
 *
 * 4. **UART debug** - MOVED TO MAIN()
 *    - SCI9 initialized in main() before hardware_init() is called
 *    - Error logging available for all peripheral init below
 *    - See main.c for early UART initialization
 *
 * 5. **Communication peripherals** (planned, not yet implemented)
 *    - SPI for motor drivers and sensors
 *    - I2C for IMU, temperature sensors
 *    - USB CDC for ROS2 communication
 *
 * 6. **ADC channels** (planned, not yet implemented)
 *    - Current sensing (motor protection)
 *    - Battery voltage monitoring
 *    - Temperature sensing (thermal management)
 *
 * ## Hardware Initialization Architecture
 *
 * @dot
 * digraph hardware_init {
 *   rankdir=TB;
 *   node [shape=box];
 *
 *   Entry [label="hardware_init()", shape=ellipse];
 *   Precond [label="Precondition Check\nSCKCR3 != reset state"];
 *   GPIO [label="GPIO Init\n(Planned)", style=dashed];
 *   Timers [label="Timer Init\nCMT0 @ 1 kHz", style=filled, fillcolor=lightgreen];
 *   UART [label="UART Debug Init\nSCI9 @ 115200", style=filled, fillcolor=lightgreen];
 *   SPI [label="SPI Init\n(Planned)", style=dashed];
 *   I2C [label="I2C Init\n(Planned)", style=dashed];
 *   ADC [label="ADC Init\n(Planned)", style=dashed];
 *   Postcond [label="Postcondition Check\nSCKCR3 still valid"];
 *   Exit [label="return k_rx_ok", shape=ellipse];
 *
 *   Entry -> Precond;
 *   Precond -> GPIO [label="Assert OK"];
 *   GPIO -> Timers;
 *   Timers -> UART [label="k_rx_ok"];
 *   UART -> SPI [label="k_rx_ok"];
 *   SPI -> I2C;
 *   I2C -> ADC;
 *   ADC -> Postcond;
 *   Postcond -> Exit [label="Assert OK"];
 *
 *   Timers -> Halt [label="Error", color=red];
 *   UART -> Halt [label="Error", color=red];
 *   SPI -> Halt [label="Error", color=red];
 *
 *   Halt [label="return error", shape=octagon, color=red];
 * }
 * @enddot
 *
 * ## Initialization Timing (RX72N @ 240 MHz)
 *
 * | Stage | Duration | Implementation | Notes |
 * |-------|----------|----------------|-------|
 * | **Precondition check** | ~0.5 µs | [COMPLETE] | SCKCR3 register read + assert |
 * | **GPIO init** | ~5 µs | [PENDING] Planned | Pin mode, pull-up/down, output levels |
 * | **Timer init** | ~10 µs | [COMPLETE] | CMT0 setup for ThreadX tick |
 * | **UART debug** | ~50 µs | [COMPLETE] | SCI9 baud rate, FIFO, interrupts |
 * | **SPI init** | ~20 µs | [PENDING] Planned | RSPI0/1 mode, clock, DMA config |
 * | **I2C init** | ~15 µs | [PENDING] Planned | RIIC0 speed, addressing, interrupts |
 * | **ADC init** | ~100 µs | [PENDING] Planned | ADC0 calibration, channel config |
 * | **Postcondition check** | ~0.5 µs | [COMPLETE] | SCKCR3 stability verification |
 * | **Total (current)** | **~61 µs** | Timers + UART only | |
 * | **Total (planned)** | **~201 µs** | All peripherals | |
 *
 * ## Memory Usage
 *
 * | Object | Size | Location | Purpose |
 * |--------|------|----------|---------|
 * | **s_sckcr3_reset_state** | 1 byte | .rodata | Clock validation constant |
 * | **Function stack** | ~64 bytes | Main stack | Local variables, return addresses |
 * | **Peripheral registers** | N/A | Memory-mapped | Hardware configuration only |
 *
 * **Total RAM:** ~64 bytes (stack only - no heap, no static buffers)
 *
 * ## Error Handling Strategy
 *
 * **Three-tier approach:**
 *
 * 1. **Critical errors (RX_ASSERT):**
 *    - Precondition failed (clocks not initialized)
 *    - Postcondition failed (clock system corrupted)
 *    - Register pointer NULL (memory map violation)
 *    - **Action:** Halt execution immediately (fail-fast)
 *
 * 2. **Peripheral errors (return error code):**
 *    - Timer init failed (timer_init() returns error)
 *    - UART init failed (uart_debug_init() returns error)
 *    - SPI/I2C/ADC init failed (when implemented)
 *    - **Action:** Return error to main(), which halts boot
 *
 * 3. **Non-critical warnings (log and continue):**
 *    - GPIO pin already configured (no action needed)
 *    - Peripheral module already enabled (idempotent operation)
 *    - **Action:** Log warning, return k_rx_ok
 *
 * ## NASA Power of 10 Compliance
 *
 * | Rule | Status | Implementation Notes |
 * |------|--------|----------------------|
 * | **Rule 1: Control flow** | [PASS] | No goto, setjmp, or recursion |
 * | **Rule 2: Loop bounds** | [PASS] | No loops (sequential initialization) |
 * | **Rule 3: Heap allocation** | [PASS] | Zero dynamic allocation (static only) |
 * | **Rule 4: Function length** | [PASS] | hardware_init() = 80 lines |
 * | **Rule 5: Assertions** | [PASS] | 2 preconditions, 1 postcondition |
 * | **Rule 6: Data scope** | [PASS] | All variables at function scope |
 * | **Rule 7: Return checks** | [PASS] | All init functions checked via rx_err_is_error() |
 * | **Rule 8: Preprocessor** | [PASS] | Zero macros (uses typed enum for constant) |
 * | **Rule 9: Pointers** | [PASS] | Single-level dereferencing only |
 * | **Rule 10: Warnings** | [PASS] | Compiles with -Wall -Wextra -Werror |
 *
 * ## SOLID Principles
 *
 * | Principle | Application |
 * |-----------|-------------|
 * | **Single Responsibility** | hardware_init() does ONLY peripheral setup (no business logic) |
 * | **Open/Closed** | New peripherals added without modifying existing init calls |
 * | **Liskov Substitution** | All init functions return rx_err_t with consistent semantics |
 * | **Interface Segregation** | Small, focused init APIs (timer_init, uart_init, etc. separate) |
 * | **Dependency Inversion** | Depends on abstractions (rx_err_t), not implementations |
 *
 * ## Thread Safety
 *
 * **Pre-ThreadX context:** This file executes in **single-threaded mode** before the RTOS starts.
 * No synchronization primitives needed. Hardware registers accessed directly without mutex protection.
 *
 * **Post-init:** After this function returns, peripherals are **ready for multi-threaded access**.
 * Application threads must use appropriate synchronization (mutexes, semaphores) when accessing
 * shared hardware resources.
 *
 * ## Related Files
 *
 * - **Clock init:** See [rx_clock_power_init.c](rx_clock_power_init.c) - Must complete BEFORE this file
 * - **Main entry:** See [main.c](main.c) - Calls this function during boot sequence
 * - **Timer HAL:** See [timer.c](../lib/rx_hal/src/timer.c) - CMT0 configuration for ThreadX tick
 * - **UART HAL:** See [uart.c](../lib/rx_hal/src/uart.c) - SCI9 configuration for debug console
 *
 * @note **This file is incomplete.** GPIO, SPI, I2C, and ADC initialization are planned but not yet
 *       implemented. Only timers and UART are functional in current version.
 *
 * @warning **Never call hardware_init() before rx_clock_power_init().** System clocks must be
 *          configured first. Precondition assertion will halt execution if violated.
 *
 * @see hardware_init() Main initialization function (entry point for this file)
 * @see rx_clock_power_init() System clock configuration (must call first)
 * @see timer_init() Configure CMT0 for ThreadX tick
 * @see uart_debug_init() Configure SCI9 for debug console
 *
 * @since Version 1.0.0
 *
 * @par Revision History:
 * - v1.0.0 (2026-01): Initial implementation with timers and UART
 *
 * @date 2026-01-14
 * @copyright Copyright (c) 2026 STAR Project
 */

#include "hardware_init.h"

#include "hardware.h"
#include "rx72n_system_regs.h"
#include "rx_check.h"
#include "rx_err.h"
#include "rx_gptw.h"
#include "rx_mpc.h"
#include "rx_poeg.h"
#include "rx_simulator_config.h" /* For RX_IS_SIMULATOR conditional compilation */

/** @brief Port pin identifiers for MPC configuration (rx_port_pin_t values) */
typedef enum : uint16_t {
  /* Host I2C (RIIC0) */
  k_pin_host_scl0  = k_rx_p1_2, /**< P1.2 - SCL0 (host I2C clock) */
  k_pin_host_sda0  = k_rx_p1_3, /**< P1.3 - SDA0 (host I2C data) */

  /* BMS I2C (RIIC1) */
  k_pin_bms_sda1   = k_rx_p2_0, /**< P2.0 - SDA1 (BMS I2C data) */
  k_pin_bms_scl1   = k_rx_p2_1, /**< P2.1 - SCL1 (BMS I2C clock) */

  /* USB */
  k_pin_usb_vbus   = k_rx_p1_6, /**< P1.6 - USB0_VBUS (USB VBUS detect) */

