Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/hardware_init.c
  /* Host SPI (RSPI2 channel A on PORTD) */
  k_pin_host_copi  = k_rx_pd_1, /**< PD.1 - MOSIC (RSPI2 COPI) */
  k_pin_host_cipo  = k_rx_pd_2, /**< PD.2 - MISOC (RSPI2 CIPO) */
  k_pin_host_sclk  = k_rx_pd_3, /**< PD.3 - RSPCKC (RSPI2 clock) */
  k_pin_host_cs0   = k_rx_pd_4, /**< PD.4 - SSLC0 (RSPI2 chip select) */

  /* MTU Encoder clock inputs (front wheels) */
  k_pin_enc0_pha   = k_rx_p2_4, /**< P2.4 - MTCLKA (encoder 0 phase A) */
  k_pin_enc0_phb   = k_rx_p2_5, /**< P2.5 - MTCLKB (encoder 0 phase B) */
  k_pin_enc1_pha   = k_rx_pa_1, /**< PA.1 - MTCLKC (encoder 1 phase A) */
  k_pin_enc1_phb   = k_rx_pc_5, /**< PC.5 - MTCLKD (encoder 1 phase B) */

  /* GPTW PWM outputs (4 motors × 2 pins = PH + EN) */
  k_pin_motor0_ph  = k_rx_p2_3, /**< P2.3 - GTIOC0A (motor 0 phase) */
  k_pin_motor0_en  = k_rx_p1_7, /**< P1.7 - GTIOC0B (motor 0 enable) */
  k_pin_motor1_ph  = k_rx_p2_2, /**< P2.2 - GTIOC1A (motor 1 phase) */
  k_pin_motor1_en  = k_rx_pc_3, /**< PC.3 - GTIOC1B (motor 1 enable) */
  k_pin_motor2_ph  = k_rx_pe_3, /**< PE.3 - GTIOC2A (motor 2 phase) */
  k_pin_motor2_en  = k_rx_p8_6, /**< P8.6 - GTIOC2B (motor 2 enable) */
  k_pin_motor3_ph  = k_rx_pe_7, /**< PE.7 - GTIOC3A (motor 3 phase) */
  k_pin_motor3_en  = k_rx_pc_6, /**< PC.6 - GTIOC3B (motor 3 enable) */

  /* ADC current sense (S12AD0, AN004-AN007) */
  k_pin_adc_an004  = k_rx_p4_4, /**< P4.4 - AN004 (motor 3 current) */
  k_pin_adc_an005  = k_rx_p4_5, /**< P4.5 - AN005 (motor 2 current) */
  k_pin_adc_an006  = k_rx_p4_6, /**< P4.6 - AN006 (motor 1 current) */
  k_pin_adc_an007  = k_rx_p4_7, /**< P4.7 - AN007 (motor 0 current) */
} rx_mpc_pin_t;

/** @brief Number of GPTW motor control pins */
typedef enum : uint8_t {
  k_gptw_pin_count = 8, /**< 4 motors x 2 pins (PH + EN) */
} gptw_pin_count_t;

/** @brief GPTW PWM frequency constant */
typedef enum : uint32_t {
  k_gptw_pwm_freq_hz  = 20000, /**< 20 kHz PWM frequency */
} gptw_freq_t;

/** @brief GPTW dead-time constant */
typedef enum : uint16_t {
  k_gptw_deadtime_ns = 1000, /**< 1 us dead-time between complementary outputs */
} gptw_deadtime_t;

/** @brief RSPI2 channel number for host SPI */
typedef enum : uint8_t {
  k_host_spi_channel = 2, /**< RSPI2 = host SPI peripheral */
} spi_channel_t;

/** @brief I2C bus frequency constants */
typedef enum : uint32_t {
  k_i2c_host_freq_hz = 400000, /**< 400 kHz fast mode for host */
  k_i2c_bms_freq_hz  = 100000, /**< 100 kHz standard mode for BMS */
} i2c_freq_t;

/** @brief Number of motor current ADC channels */
typedef enum : uint8_t {
  k_motor_adc_count = 4, /**< 4 motors = 4 current sense channels */
} adc_count_t;

/** @brief SCKCR3 reset/unconfigured state value (before clock initialization) */
static const uint8_t s_sckcr3_reset_state = 0U;

/**
 * @brief Initialize GPIO pins for motor control, I2C, and USB communication
 *
 * @details
 * Configures Multi-Function Pin Controller (MPC) for 8 critical pins used in STAR
 * robot application. All pins are configured for peripheral mode (not GPIO), with
 * specific PSEL values determined by hardware function.
 *
 * **Pin configuration:**
 * - **5× MTU PWM pins** - Motor control via DRV8243 H-bridge drivers
 * - **2× I2C pins** - Sensor communication bus (SCL/SDA)
 * - **1× USB pin** - USB VBUS detection for CDC debug interface
 *
 * **Algorithm steps:**
 * 1. Validate all pin identifiers are within valid range
 * 2. Configure MTU PWM pins (PSEL = 0x01) for motor control
 * 3. Configure I2C pins (PSEL = 0x0F) for sensor bus
 * 4. Configure USB pin (PSEL = 0x11) for USB VBUS detect
 * 5. All operations use rx_mpc API with write-protect handling
 *
 * ## Pin Allocation Table
 *
 * | Pin | Port.Bit | Function | PSEL | Usage |
 * |-----|----------|----------|------|-------|
 * | P1.5 | PORT1.5 | MTIOC0B | 0x01 | Motor 0 PWM output |
 * | PC.1 | PORTC.1 | MTIOC3A | 0x01 | Motor 3 PWM output A |
 * | P2.2 | PORT2.2 | MTIOC3B | 0x01 | Motor 3 PWM output B |
 * | P2.4 | PORT2.4 | MTIOC4A | 0x01 | Motor 4 PWM output A |
 * | P2.5 | PORT2.5 | MTIOC4C | 0x01 | Motor 4 PWM output C |
 * | P1.2 | PORT1.2 | SCL0 | 0x0F | I2C clock line |
 * | P1.3 | PORT1.3 | SDA0 | 0x0F | I2C data line |
 * | P1.6 | PORT1.6 | USB0_VBUS | 0x11 | USB VBUS detect input |
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok All 8 pins configured successfully
 * @retval k_rx_err_invalid_arg Pin identifier out of range (programming error)
 * @retval k_rx_err_hw_error MPC write-protect unlock failed (hardware fault)
 *
 * @pre PCLKB clock must be running (MPC registers require active clock)
 * @pre Must be called during single-threaded initialization (before RTOS starts)
 *
 * @post All 8 pins configured for peripheral mode (PMR = 1)
 * @post PWPR register locked (B0WI = 1, write protection active)
 * @post Motor control pins ready for MTU PWM output
 * @post I2C pins ready for RIIC communication
 * @post USB pin ready for VBUS detection
 *
 * @note **Thread Safety**: Not thread-safe. Must be called during initialization
 *       before ThreadX kernel starts. Do not call from running RTOS tasks.
 *
 * @note **Re-entrancy**: Not reentrant. Calling multiple times is safe (idempotent)
 *       but wastes CPU cycles re-writing same register values.
 *
 * @note **Performance**: Execution time ~15 µs @ 240 MHz (8 pins × 2 µs/pin).
 *       One-time initialization cost, not runtime overhead.
 *
 * @warning **Pin conflicts**: If pins are already in use by another peripheral,
 *          reconfiguring them here will break that peripheral's functionality.
 *          Ensure pin allocations match hardware schematic.
 *
 * @warning **Motor safety**: Motor control pins must be configured before enabling
 *          MTU channels. Unconfigured PWM pins can cause undefined motor behavior.
 *
 * @par Example - Normal Initialization:
 * @code
 * // Called from hardware_init() during boot
 * rx_err_t err = gpio_init();
 * if (err != k_rx_ok) {
 *     rx_log_error("HWINT", "GPIO init failed: %d", err);
 *     return err;
 * }
 *
 * // Now safe to initialize motor drivers
 * err = motor_init();
 * @endcode
 *
 * @par Example - Error Handling:
 * @code
 * rx_err_t err = gpio_init();
 * switch (err) {
 *     case k_rx_ok:
 *         rx_log_info("GPIO", "8 pins configured successfully");
 *         break;
 *     case k_rx_err_invalid_arg:
 *         // Programming error - invalid pin constant used
 *         rx_log_error("GPIO", "Invalid pin identifier");
 *         return err;
 *     case k_rx_err_hw_error:
 *         // Hardware fault - MPC registers not accessible
 *         rx_log_error("GPIO", "MPC hardware fault");
 *         return err;
 * }
 * @endcode
 *
 * @see rx_mpc_set_mtu_pwm() Configure pin for MTU PWM output
 * @see rx_mpc_set_riic() Configure pin for I2C bus function
 * @see rx_mpc_set_peripheral() Generic pin configuration
 * @see RX72N Manual Chapter 23 - Multi-Function Pin Controller
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance
 * - **Rule 1** [OK] No goto, setjmp, recursion (sequential pin configuration)
 * - **Rule 2** [OK] No loops (8 pins configured sequentially, statically known)
 * - **Rule 3** [OK] No dynamic allocation (all register I/O)
 * - **Rule 4** [OK] Function is 45 lines (under 60 line limit)
 * - **Rule 5** [OK] 2 preconditions, 5 postconditions documented
 * - **Rule 6** [OK] Minimal scope (no local variables)
 * - **Rule 7** [OK] All rx_mpc_set_*() return values checked
 * - **Rule 8** [OK] Uses C23 typed enums for pin identifiers
 * - **Rule 9** [OK] Single level of function call dereferencing
 * - **Rule 10** [OK] Compiles with -Wall -Wextra -Werror
 */
static rx_err_t gpio_init(void)
{
  rx_err_t           err;
  static const char* s_tag = "GPIO";

  /* ---- Host I2C (RIIC0): SCL0 + SDA0 ---- */
  err = rx_mpc_set_riic((rx_port_pin_t)k_pin_host_scl0); /* P1.2 = SCL0 */
  RX_RETURN_ON_ERROR(err, s_tag, "SCL0 pin config failed");

  err = rx_mpc_set_riic((rx_port_pin_t)k_pin_host_sda0); /* P1.3 = SDA0 */
  RX_RETURN_ON_ERROR(err, s_tag, "SDA0 pin config failed");

  /* ---- BMS I2C (RIIC1): SCL1 + SDA1 ---- */
  err = rx_mpc_set_riic((rx_port_pin_t)k_pin_bms_scl1); /* P2.1 = SCL1 */
  RX_RETURN_ON_ERROR(err, s_tag, "SCL1 pin config failed");

